app/views/recipes/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."recipe_id" = ?  [["recipe_id", 1]]
---
         <div id="chats">
           <% @recipe.post_comments.each do |post_comment| %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."recipe_id" = ?  [["recipe_id", 1]]
---
           <% end %>
    <p>コメント件数：<%= @recipe.post_comments.count %> </p>