app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("user_id", "title", "body", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = current_user.recipes.build(recipe_params)
    if @recipe.save

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC
---
  def index
    @recipes = Recipe.all.order(id: "DESC")

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy